In [6]:
from sqlalchemy import create_engine
from sqlalchemy.engine import URL

server = r"HFTL-RA-0013\SQLEXPRESS03"
database = "expense_tracker"

connection_url = URL.create(
    "mssql+pyodbc",
    host=server,
    database=database,
    query={
        "driver": "ODBC Driver 17 for SQL Server",
        "Trusted_Connection": "yes"
    }
)

engine = create_engine(connection_url)

try:
    with engine.connect() as connection:
        print("Connection successful!")
except Exception as e:
    print("Connection failed:", e)

Connection successful!

In [3]:
import pandas as pd
df1 = pd.read_sql("SELECT * FROM daily_expenses", engine)
df1.tail(7)

      id expense_date  transport  food  data  other  total
42  3029   2026-02-02       23.0  20.0   6.0    0.0   49.0
43  3030   2026-02-03       34.0   0.0  12.0   10.0   56.0
44  3031   2026-02-04       23.0  10.0  12.0    0.0   45.0
45  3032   2026-02-05       24.0  20.0  12.0    0.0   56.0
46  3033   2026-02-06       24.0   0.0  12.0    0.0   36.0
47  3034   2026-02-07       35.0  15.0  12.0   35.0   97.0
48  3035   2026-02-08       47.0  15.0  12.0   10.0   84.0

In [5]:
import pandas as pd
df2 = pd.read_sql("SELECT * FROM daily_budget", engine)
df2.tail(6)

      id budget_date  budget_amount
46  3032  2026-02-07           60.0
47  3033  2026-02-08           80.0
48  3034  2026-02-09           30.0
49  3035  2026-02-10           40.0
50  3036  2026-02-11           40.0
51  3037  2026-02-12           50.0

In [ ]:
pd.read_sql("SELECT * FROM weekly_budget", engine)

     id  week_start  money_available  weekly_budget  expected_income
0     1  2025-12-22            425.0          400.0            150.0
1     2  2025-12-29            350.0          241.0            300.0
2  1002  2026-01-05            400.0          150.0            200.0
3  2002  2026-01-12            300.0          500.0            500.0
4  3002  2026-01-19            300.0          130.0            200.0
5  3003  2026-01-26            800.0          500.0            200.0
6  3004  2026-02-02            450.0          420.0            200.0

In [ ]:
import pandas as pd

tables = {
    "Daily_budget": "daily_budget",
    "weekly_budget": "weekly_budget",
    "daily_expenses": "daily_expenses"
}

with pd.ExcelWriter("expense_tracker_backup.xlsx", engine="openpyxl") as writer:
    for sheet, table in tables.items():
        df = pd.read_sql(f"SELECT * FROM {table}", engine)
        df.to_excel(writer, sheet_name=sheet, index=False)

print("Excel file created successfully")

Excel file created successfully